app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        respond_with User.all

INSERT INTO "users" ("name", "email", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Pedro"], ["email", "pedro@email.com"], ["birthdate", "1987-08-12"], ["created_at", "2016-09-08 18:35:30.378435"], ["updated_at", "2016-09-08 18:35:30.378435"]]
---
    def create
        if @user.present?
            render nothing: true, status: :conflict
        else
            @user = User.new
            @user.assign_attributes(@json['user'])
            if @user.save